In [1]:
import numpy as np
import pandas as pd

In [18]:
#### analyzing 1 file of florida Data for English

path = "C:/Users/ameen/Desktop/Covid_learning_gap_ML_project_17_oct/datasets/florida/english/2017"
grade = 3
df1 = pd.DataFrame()

while grade < 8:
    df = pd.read_excel(path+'/grade_'+str(grade)+'_ela.xls')
    df1 = pd.concat([df1,df])
    grade += 1
    
df1.head()

,District Number,District Name,Grade,Number of Students,Mean Scale Score,Percentage in Level 3 or Above,1,2,3,4,5
0,0,STATE TOTALS,3,228104,303,58,19,23,28,21,9
1,1,ALACHUA,3,2457,303,56,20,24,25,20,11
2,2,BAKER,3,388,305,64,10,26,34,24,6
3,3,BAY,3,2267,303,59,16,25,33,19,7
4,4,BRADFORD,3,244,298,44,19,37,29,14,2

In [21]:
df1.columns

Index([               'District Number',                  'District Name',
                                'Grade',             'Number of Students',
                    'Mean Scale Score ', 'Percentage in Level 3 or Above',
                                      1,                                2,
                                      3,                                4,
                                      5],
      dtype='object')

In [22]:
df1.info()

##mean scale score is int so no need to change

<class 'pandas.core.frame.DataFrame'>
Int64Index: 370 entries, 0 to 73
Data columns (total 11 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   District Number                 370 non-null    int64
 1   District Name                   370 non-null    object
 2   Grade                           370 non-null    int64
 3   Number of Students              370 non-null    int64
 4   Mean Scale Score                370 non-null    int64
 5   Percentage in Level 3 or Above  370 non-null    int64
 6   1                               370 non-null    int64
 7   2                               370 non-null    int64
 8   3                               370 non-null    int64
 9   4                               370 non-null    int64
 10  5                               370 non-null    int64
dtypes: int64(10), object(1)
memory usage: 34.7+ KB

In [24]:
relevant_col = ['District Number','District Name','Grade', 'Mean Scale Score ']

df2 = df1[relevant_col]
df2.head()

   District Number District Name  Grade  Mean Scale Score
0                0  STATE TOTALS      3                303
1                1       ALACHUA      3                303
2                2         BAKER      3                305
3                3           BAY      3                303
4                4      BRADFORD      3                298

In [25]:
for col in df2:
    print(df2[col].unique())
    
## mean scale score doesnt have any absurd scores

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47
 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 71 72 73
 74 75]
['STATE TOTALS' 'ALACHUA' 'BAKER' 'BAY' 'BRADFORD' 'BREVARD' 'BROWARD'
 'CALHOUN' 'CHARLOTTE' 'CITRUS' 'CLAY' 'COLLIER' 'COLUMBIA' 'DADE'
 'DESOTO' 'DIXIE' 'DUVAL' 'ESCAMBIA' 'FLAGLER' 'FRANKLIN' 'GADSDEN'
 'GILCHRIST' 'GLADES' 'GULF' 'HAMILTON' 'HARDEE' 'HENDRY' 'HERNANDO'
 'HIGHLANDS' 'HILLSBOROUGH' 'HOLMES' 'INDIAN RIVER' 'JACKSON' 'JEFFERSON'
 'LAFAYETTE' 'LAKE' 'LEE' 'LEON' 'LEVY' 'LIBERTY' 'MADISON' 'MANATEE'
 'MARION' 'MARTIN' 'MONROE' 'NASSAU' 'OKALOOSA' 'OKEECHOBEE' 'ORANGE'
 'OSCEOLA' 'PALM BEACH' 'PASCO' 'PINELLAS' 'POLK' 'PUTNAM' 'ST. JOHNS'
 'ST. LUCIE' 'SANTA ROSA' 'SARASOTA' 'SEMINOLE' 'SUMTER' 'SUWANNEE'
 'TAYLOR' 'UNION' 'VOLUSIA' 'WAKULLA' 'WALTON' 'WASHINGTON' 'DEAF/BLIND'
 'FL VIRTUAL' 'FAU LAB SCH' 'FSU LAB SCH' 'FAMU LAB SCH' 'UF LAB SCH']
[3 4 5 6 7]
[303 305 298 306 302 308 290 300 292 301 293 297 304 299 307 312 295 314
 310 309 274 315 311 313 294 318 317 321 319 316 287 324 323 320 322 325
 326 330 333 328 337 329 327 331 336 332 335 334 338 344 339 342 346 340]

In [26]:
for col in df2:
    print("couunt of NA values in", col)
    print(df2[col].isnull().sum())

couunt of NA values in District Number
0
couunt of NA values in District Name
0
couunt of NA values in Grade
0
couunt of NA values in Mean Scale Score
0

In [27]:
df2.info()

## mean scale score needs to be converted to int value

<class 'pandas.core.frame.DataFrame'>
Int64Index: 370 entries, 0 to 73
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   District Number    370 non-null    int64
 1   District Name      370 non-null    object
 2   Grade              370 non-null    int64
 3   Mean Scale Score   370 non-null    int64
dtypes: int64(3), object(1)
memory usage: 14.5+ KB

In [64]:
#### analyzing 1 file of florida Data for English

path = "C:/Users/ameen/Desktop/Covid_learning_gap_ML_project_17_oct/datasets/florida/maths/2017"
grade = 3
df1 = pd.DataFrame()

while grade < 8:
    df = pd.read_excel(path+'/'+str(grade)+'.xls')
    df1 = pd.concat([df1,df])
    grade += 1
    
df1.head()

,District Number,District Name,Grade,Number of Students,Mean Scale Score,Percentage in Level 3 or Above,1,2,3,4,5,Percentage \nLevel 3 or Above,Achievement Levels 3 and Above
0,1,ALACHUA,3,2480,302,60.0,22,18,24,22,13,NaN,NaN
1,2,BAKER,3,388,307,75.0,7,18,36,29,11,NaN,NaN
2,3,BAY,3,2277,299,56.0,21,22,27,21,8,NaN,NaN
3,4,BRADFORD,3,242,297,50.0,23,26,31,14,5,NaN,NaN
4,5,BREVARD,3,5639,302,63.0,17,20,29,23,11,NaN,NaN

In [63]:
df12 = df1[['Grade','Percentage \nLevel 3 or Above']].value_counts().sort_values(ascending = False)

df1[df1['Percentage \nLevel 3 or Above'].isnull()]['Grade'].unique()

## gread 3,5,6 doesnot have last 2 columns

array([3, 5, 6], dtype=int64)

In [65]:
df1.columns

Index([               'District Number',                  'District Name',
                                'Grade',             'Number of Students',
                    'Mean Scale Score ', 'Percentage in Level 3 or Above',
                                      1,                                2,
                                      3,                                4,
                                      5,  'Percentage \nLevel 3 or Above',
       'Achievement Levels 3 and Above'],
      dtype='object')

In [66]:
df1.info()

##mean scale score is int so no need to change

<class 'pandas.core.frame.DataFrame'>
Int64Index: 365 entries, 0 to 72
Data columns (total 13 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   District Number                 365 non-null    int64
 1   District Name                   365 non-null    object
 2   Grade                           365 non-null    int64
 3   Number of Students              365 non-null    int64
 4   Mean Scale Score                365 non-null    int64
 5   Percentage in Level 3 or Above  146 non-null    float64
 6   1                               365 non-null    int64
 7   2                               365 non-null    int64
 8   3                               365 non-null    int64
 9   4                               365 non-null    int64
 10  5                               365 non-null    int64
 11  Percentage
Level 3 or Above    146 non-null    float64
 12  Achievement Levels 3 and Above  73 non-null     float64
dtypes: float64(3), int64(9), object(1)
memory usage: 39.9+ KB

In [67]:
relevant_col = ['District Number','District Name','Grade', 'Mean Scale Score ']

df2 = df1[relevant_col]
df2.head()

   District Number District Name  Grade  Mean Scale Score
0                1       ALACHUA      3                302
1                2         BAKER      3                307
2                3           BAY      3                299
3                4      BRADFORD      3                297
4                5       BREVARD      3                302

In [69]:
for col in df2:
    print(df2[col].unique())
    
## mean scale score doesnt have any absurd scores

[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48
 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 71 72 73 74
 75]
['ALACHUA' 'BAKER' 'BAY' 'BRADFORD' 'BREVARD' 'BROWARD' 'CALHOUN'
 'CHARLOTTE' 'CITRUS' 'CLAY' 'COLLIER' 'COLUMBIA' 'DADE' 'DESOTO' 'DIXIE'
 'DUVAL' 'ESCAMBIA' 'FLAGLER' 'FRANKLIN' 'GADSDEN' 'GILCHRIST' 'GLADES'
 'GULF' 'HAMILTON' 'HARDEE' 'HENDRY' 'HERNANDO' 'HIGHLANDS' 'HILLSBOROUGH'
 'HOLMES' 'INDIAN RIVER' 'JACKSON' 'JEFFERSON' 'LAFAYETTE' 'LAKE' 'LEE'
 'LEON' 'LEVY' 'LIBERTY' 'MADISON' 'MANATEE' 'MARION' 'MARTIN' 'MONROE'
 'NASSAU' 'OKALOOSA' 'OKEECHOBEE' 'ORANGE' 'OSCEOLA' 'PALM BEACH' 'PASCO'
 'PINELLAS' 'POLK' 'PUTNAM' 'ST. JOHNS' 'ST. LUCIE' 'SANTA ROSA'
 'SARASOTA' 'SEMINOLE' 'SUMTER' 'SUWANNEE' 'TAYLOR' 'UNION' 'VOLUSIA'
 'WAKULLA' 'WALTON' 'WASHINGTON' 'DEAF/BLIND' 'FL VIRTUAL' 'FAU LAB SCH'
 'FSU LAB SCH' 'FAMU LAB SCH' 'UF LAB SCH']
[3 4 5 6 7]
[302 307 299 297 305 306 304 291 298 295 303 300 301 308 292 296 312 311
 278 294 310 313 317 316 314 318 319 320 315 322 324 323 326 321 309 284
 328 325 333 337 331 329 330 327 285 334 332 336 345 339 335 338 340 348]

In [70]:
for col in df2:
    print("couunt of NA values in", col)
    print(df2[col].isnull().sum())

couunt of NA values in District Number
0
couunt of NA values in District Name
0
couunt of NA values in Grade
0
couunt of NA values in Mean Scale Score
0